Revit 2027 API
ContentNode.GetAsset Method
 Returns an an instance of an Asset object, which contains definitions of the content node.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Asset GetAsset()
Public Function GetAsset As Asset
public:
Asset^ GetAsset()
member GetAsset : unit -> Asset
Return Value
Asset
Remarks
 Properties and attributes of the node can be accessed using the standard interface of the Asset class.
See Also
Reference
ContentNode Class
Autodesk.Revit.DB Namespace